# coding:utf8

import DigitalSumLoginHack

__author__ = "Snake"

#             Python大法好 入教保平安
#                    _ooOoo_
#                   o8888888o
#                   88" . "88
#                   (| °_° |)
#                   O\  =  /O
#                ____/`---'\____
#              .'  \\|     |//  `.
#             /  \\|||  :  |||//  \
#            /  _||||| -:- |||||-  \
#            |   | \\\  -  /// |   |
#            | \_|  ''\---/''  |   |
#            \  .-\__  `-`  ___/-. /
#          ___`. .'  /--.--\  `. . __
#       ."" '<  `.___\_<|>_/___.'  >'"".
#      | | :  `- \`.;`\ _ /`;.`/ - ` : | |
#      \  \ `-.   \_ __\ /__ _/   .-` /  /
# ======`-.____`-.___\_____/___.-`____.-'======
#                    `=---='
# ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
#             佛祖保佑       永无BUG
#    练手项目 锻炼技巧 不要做坏事 出事与本人无关

f = open("dic.txt", "r")
while True:
    line = f.readline()
    if line:
        line = int(line)
        # 输入工号or学号就行了
        id = ''
        DigitalSumLoginHack.password_blasting(id, line)
    else:
        break
f.close()
